In [1]:
import pandas as pd;

In [2]:
data = pd.DataFrame([1,2,3,4], columns=['serial'])
data

   serial
0       1
1       2
2       3
3       4

In [3]:
data2 = pd.DataFrame({
    'name':['vishal', 'om', 'shubz'], 
    'age':[22,33,44], 
    'department':['computer', 'chemical', 'IT'], 
    'joing_Date':['2002-01-30', '2023-12-23', '2024-12-2'] 
})
data2

     name  age department  joing_Date
0  vishal   22   computer  2002-01-30
1      om   33   chemical  2023-12-23
2   shubz   44         IT   2024-12-2

In [4]:
data2.head()

     name  age department  joing_Date
0  vishal   22   computer  2002-01-30
1      om   33   chemical  2023-12-23
2   shubz   44         IT   2024-12-2

In [5]:
data2.tail()

     name  age department  joing_Date
0  vishal   22   computer  2002-01-30
1      om   33   chemical  2023-12-23
2   shubz   44         IT   2024-12-2

In [6]:
data2.shape

(3, 4)

In [7]:
data2.size

12

In [10]:
data2.describe()

        age
count   3.0
mean   33.0
std    11.0
min    22.0
25%    27.5
50%    33.0
75%    38.5
max    44.0

In [11]:
data2.info

<bound method DataFrame.info of      name  age department  joing_Date
0  vishal   22   computer  2002-01-30
1      om   33   chemical  2023-12-23
2   shubz   44         IT   2024-12-2>

In [14]:
data2 = data2.rename(columns={'name':'Full_name'})

In [15]:
data2

  Full_name  age department  joing_Date
0    vishal   22   computer  2002-01-30
1        om   33   chemical  2023-12-23
2     shubz   44         IT   2024-12-2

In [16]:
data2

  Full_name  age department  joing_Date
0    vishal   22   computer  2002-01-30
1        om   33   chemical  2023-12-23
2     shubz   44         IT   2024-12-2

In [17]:
data2.to_csv('data2.csv', index=False)

In [18]:
load = pd.read_csv('data2.csv')

In [19]:
load

  Full_name  age department  joing_Date
0    vishal   22   computer  2002-01-30
1        om   33   chemical  2023-12-23
2     shubz   44         IT   2024-12-2

In [22]:
data2

  Full_name  age department  joing_Date
0    vishal   22   computer  2002-01-30
1        om   33   chemical  2023-12-23
2     shubz   44         IT   2024-12-2

In [25]:
data2[['age', 'department']]

   age department
0   22   computer
1   33   chemical
2   44         IT

In [31]:
data2.loc[data2.Full_name == 'vishal']

  Full_name  age department  joing_Date
0    vishal   22   computer  2002-01-30

In [34]:
data2['joing_Date'].dtype

dtype('O')

In [37]:
data2['joing_Date'] = pd.to_datetime(data2['joing_Date'], format='%y-%m-%d')

In [38]:
data2['joing_Date'].dtype

dtype('<M8[ns]')

In [39]:
data2['joing_Date'].dt.year

0    2002
1    2023
2    2024
Name: joing_Date, dtype: int32

In [41]:
data2.isnull()

   Full_name    age  department  joing_Date
0      False  False       False       False
1      False  False       False       False
2      False  False       False       False

In [42]:
data2.isnull().sum()

Full_name     0
age           0
department    0
joing_Date    0
dtype: int64

In [43]:
data2.fillna(0)

  Full_name  age department joing_Date
0    vishal   22   computer 2002-01-30
1        om   33   chemical 2023-12-23
2     shubz   44         IT 2024-12-02

In [44]:
data2

  Full_name  age department joing_Date
0    vishal   22   computer 2002-01-30
1        om   33   chemical 2023-12-23
2     shubz   44         IT 2024-12-02

In [45]:
data2['salary'] = [1111,111,111]

In [46]:
data2

  Full_name  age department joing_Date  salary
0    vishal   22   computer 2002-01-30    1111
1        om   33   chemical 2023-12-23     111
2     shubz   44         IT 2024-12-02     111

In [47]:
data2.drop('salary', axis=1)

  Full_name  age department joing_Date
0    vishal   22   computer 2002-01-30
1        om   33   chemical 2023-12-23
2     shubz   44         IT 2024-12-02